<center>
    <img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/Logos/organization_logo/organization_logo.png" width="300" alt="cognitiveclass.ai logo"  />
</center>

<h1 align=center><font size = 5>Assignment: Notebook for Peer Assignment</font></h1>

# Introduction

Using this Python notebook you will:

1.  Understand three Chicago datasets
2.  Load the three datasets into three tables in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Understand the datasets

To complete the assignment problems in this notebook you will be using three datasets that are available on the city of Chicago's Data Portal:

1.  <a href="https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">Socioeconomic Indicators in Chicago</a>
2.  <a href="https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">Chicago Public Schools</a>
3.  <a href="https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">Chicago Crime Data</a>

### 1. Socioeconomic Indicators in Chicago

This dataset contains a selection of six socioeconomic indicators of public health significance and a “hardship index,” for each Chicago community area, for the years 2008 – 2012.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:
[https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2](https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### 2. Chicago Public Schools

This dataset shows all school level performance data used to create CPS School Report Cards for the 2011-2012 school year. This dataset is provided by the city of Chicago's Data Portal.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:
[https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t](https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### 3. Chicago Crime Data

This dataset reflects reported incidents of crime (with the exception of murders where data exists for each victim) that occurred in the City of Chicago from 2001 to present, minus the most recent seven days.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:
[https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2](https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### Download the datasets

This assignment requires you to have these three tables populated with a subset of the whole datasets.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the links below to download and save the datasets (.CSV files):

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCensusData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01" target="_blank">Chicago Census Data</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01" target="_blank">Chicago Public Schools</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCrimeData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01" target="_blank">Chicago Crime Data</a>

**NOTE:** Ensure you have downloaded the datasets using the links above instead of directly from the Chicago Data Portal. The versions linked here are subsets of the original datasets and have some of the column names modified to be more database friendly which will make it easier to complete this assignment.

### Store the datasets in database tables

To analyze the data using SQL, it first needs to be stored in the database.

While it is easier to read the dataset into a Pandas dataframe and then PERSIST it into the database as we saw in Week 3 Lab 3, it results in mapping to default datatypes which may not be optimal for SQL querying. For example a long textual field may map to a CLOB instead of a VARCHAR.

Therefore, **it is highly recommended to manually load the table using the database console LOAD tool, as indicated in Week 2 Lab 1 Part II**. The only difference with that lab is that in Step 5 of the instructions you will need to click on create "(+) New Table" and specify the name of the table you want to create and then click "Next".

<img src = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/images/LoadingData.png">

##### Now open the Db2 console, open the LOAD tool, Select / Drag the .CSV file for the first dataset, Next create a New Table, and then follow the steps on-screen instructions to load the data. Name the new tables as follows:

1.  **CENSUS_DATA**
2.  **CHICAGO_PUBLIC_SCHOOLS**
3.  **CHICAGO_CRIME_DATA**

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [ ]:
!pip install sqlalchemy
!pip install ibm_db_sa
!pip install ipython-sql

In [ ]:
%reload_ext sql
%sql sqlite3://

In [25]:
%reload_ext sql
%sql pyodbc://

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])
Can't load plugin: sqlalchemy.dialects:pyodbc
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [26]:
import sqlalchemy as sql

In [10]:
import pypyodbc as podbc

In [23]:
conn = podbc.connect("Driver={SQL Server};Server=DESKTOP-FVMLNB5;Database=bludb;uid=sa;pwd=Abc@123456")
cursor = conn.cursor()
sql = "SELECT * FROM  [dbo].[Census_Data]"
cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["COMMUNITY_AREA_NUMBER","COMMUNITY_AREA_NAME","PERCENTOFHOUSINGCROWDED","PERCENTHOUSEHOLDSBELOWPOVERTY","PERCENTAGED16+UNEMPLOYED","PERCENTAGED25+WITHOUTHIGHSCHOOLDIPLOMA","PERCENTAGEDUNDER18OROVER64","PER_CAPITA_INCOME","HARDSHIP_INDEX"])
data

,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,PERCENTOFHOUSINGCROWDED,PERCENTHOUSEHOLDSBELOWPOVERTY,PERCENTAGED16+UNEMPLOYED,PERCENTAGED25+WITHOUTHIGHSCHOOLDIPLOMA,PERCENTAGEDUNDER18OROVER64,PER_CAPITA_INCOME,HARDSHIP_INDEX
0,1.0,Rogers Park,7.7,23,8,18.200001,27,23939,39.0
1,2.0,West Ridge,7.8,17,8,20.799999,38,23040,46.0
2,3.0,Uptown,3.8,24,8,11.800000,22,35787,20.0
3,4.0,Lincoln Square,3.4,10,8,13.400000,25,37524,17.0
4,5.0,North Center,0.3,7,5,4.500000,26,57123,6.0
...,...,...,...,...,...,...,...,...,...
73,74.0,Mount Greenwood,1.0,3,8,4.300000,36,34381,16.0
74,75.0,Morgan Park,0.8,13,15,10.800000,40,27149,30.0
75,76.0,O'Hare,3.6,15,7,10.900000,30,25828,24.0
76,77.0,Edgewater,4.1,18,9,9.700000,23,33385,19.0
77,NaN,CHICAGO,4.7,19,12,19.500000,33,28202,NaN

In the next cell enter your db2 connection string. Recall you created Service Credentials for your Db2 instance in first lab in Week 3. From your Db2 service credentials copy everything after db2:// (except the double quote at the end) and paste it in the cell below after ibm_db_sa://

<img src ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/images/details.png">

In [3]:
!pip install pandas --upgrade

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.3.2)
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [14]:
import pandas as pd
from pandas.compat.numpy import *

In [9]:
# Remember the connection string is of the format:
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name?security=SSL
# Enter the connection string for your Db2 on Cloud database instance below
#%sql ibm_db_sa://

%sql ibm_db_sa://gpd67891:DPXnDJ4Ms1LPUiQQ@0c77d6f2-5da9-48a9-81f8-86b520b87518.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31198/BLUDB

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])
Can't load plugin: sqlalchemy.dialects:ibm_db_sa
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

## Problems

Now write and execute SQL queries to solve assignment problems

### Problem 1

##### Find the total number of crimes recorded in the CRIME table.

In [29]:
#%sql Select count(*) as total_number_of_crimes from CHICAGO_CRIME_DATA
cursor = conn.cursor()
sql = "Select count(*) as total_number_of_crimes from CHICAGO_CRIME_DATA"
cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["total_number_of_crimes"])
data.head()

   total_number_of_crimes
0                     533

### Problem 2

##### List community areas with per capita income less than 11000.

In [33]:
cursor = conn.cursor()
sql="SELECT COMMUNITY_AREA_NAME, PER_CAPITA_INCOME FROM CENSUS_DATA WHERE PER_CAPITA_INCOME < 11000"
cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["COMMUNITY_AREA_NAME", "PER_CAPITA_INCOME"])
data

  COMMUNITY_AREA_NAME  PER_CAPITA_INCOME
0  West Garfield Park              10934
1      South Lawndale              10402
2         Fuller Park              10432
3           Riverdale               8201

### Problem 3

##### List all case numbers for crimes  involving minors?(children are not considered minors for the purposes of crime analysis)

In [40]:
cursor = conn.cursor()
sql="SELECT CASE_NUMBER FROM CHICAGO_CRIME_DATA WHERE DESCRIPTION LIKE '%MINOR%'"
cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["CASE_NUMBER"])
data

  CASE_NUMBER
0    HL266884
1    HK238408

### Problem 4

##### List all kidnapping crimes involving a child?

In [41]:
cursor = conn.cursor()
sql="SELECT CASE_NUMBER, PRIMARY_TYPE, DESCRIPTION  FROM CHICAGO_CRIME_DATA  WHERE PRIMARY_TYPE LIKE 'KIDNAPPING'"
cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["CASE_NUMBER", "PRIMARY_TYPE", "DESCRIPTION"])
data

  CASE_NUMBER PRIMARY_TYPE               DESCRIPTION
0    HN144152   KIDNAPPING  CHILD ABDUCTION/STRANGER

### Problem 5

##### What kinds of crimes were recorded at schools?

In [55]:
cursor = conn.cursor()
sql ='''SELECT DISTINCT PRIMARY_TYPE
            FROM CHICAGO_CRIME_DATA
            WHERE LOCATION_DESCRIPTION LIKE '%SCHOOL%';'''

cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["PRIMARY_TYPE"])
data

             PRIMARY_TYPE
0                 ASSAULT
1                 BATTERY
2         CRIMINAL DAMAGE
3       CRIMINAL TRESPASS
4               NARCOTICS
5  PUBLIC PEACE VIOLATION

### Problem 6

##### List the average safety score for all types of schools.

In [58]:
cursor = conn.cursor()
sql='''SELECT ElementaryMiddleorHighSchool,AVG(SAFETY_SCORE) AS AVERAGE_SAFETY_SCORE
FROM CHICAGO_PUBLIC_SCHOOLS
GROUP BY "ElementaryMiddleorHighSchool"'''

cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["Elementary, Middle, or High School",'AVERAGE_SAFETY_SCORE'])
data

  Elementary, Middle, or High School  AVERAGE_SAFETY_SCORE
0                                 ES                    49
1                                 HS                    49
2                                 MS                    48

### Problem 7

##### List 5 community areas with highest % of households below poverty line

In [62]:
cursor = conn.cursor()
sql='''SELECT TOP (6) PERCENT COMMUNITY_AREA_NAME, PERCENTHOUSEHOLDSBELOWPOVERTY
        FROM CENSUS_DATA
        ORDER BY PERCENTHOUSEHOLDSBELOWPOVERTY DESC '''

cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["COMMUNITY_AREA_NAME", "PERCENT_HOUSEHOLDS_BELOW_POVERTY"])
data

  COMMUNITY_AREA_NAME  PERCENT_HOUSEHOLDS_BELOW_POVERTY
0           Riverdale                                56
1         Fuller Park                                51
2           Englewood                                46
3      North Lawndale                                43
4  East Garfield Park                                42

### Problem 8

##### Which community area is most crime prone?

In [63]:
cursor = conn.cursor()
sql='''SELECT TOP (1) PERCENT COMMUNITY_AREA_NUMBER, COUNT(COMMUNITY_AREA_NUMBER) AS FREQUENCY
        FROM  dbo.Chicago_Crime_Data AS CCD
        GROUP BY COMMUNITY_AREA_NUMBER
        ORDER BY FREQUENCY DESC '''
cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["PERCENT COMMUNITY_AREA_NUMBER", "FREQUENCY"])
data

   PERCENT COMMUNITY_AREA_NUMBER  FREQUENCY
0                             25         43

Double-click **here** for a hint

<!--
Query for the 'community area number' that is most crime prone.
-->

### Problem 9

##### Use a sub-query to find the name of the community area with highest hardship index

In [64]:
cursor = conn.cursor()
sql='''SELECT COMMUNITY_AREA_NAME
            FROM  CENSUS_DATA
            WHERE HARDSHIP_INDEX = (SELECT MAX(HARDSHIP_INDEX) FROM CENSUS_DATA)'''
cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["COMMUNITY_AREA_NAME"])
data

  COMMUNITY_AREA_NAME
0           Riverdale

### Problem 10

##### Use a sub-query to determine the Community Area Name with most number of crimes?

In [65]:
cursor = conn.cursor()
sql='''SELECT community_area_name
FROM CENSUS_DATA 
WHERE COMMUNITY_AREA_NUMBER = (    
								 SELECT top(1) CCD.COMMUNITY_AREA_NUMBER 
									FROM CHICAGO_CRIME_DATA AS CCD 
									 GROUP BY CCD.COMMUNITY_AREA_NUMBER
									 ORDER BY COUNT(CCD.COMMUNITY_AREA_NUMBER) DESC
							)'''
cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["COMMUNITY_AREA_NAME"])
data

  COMMUNITY_AREA_NAME
0              Austin

# Exercise 1, Question 1: 

Write and execute a SQL query to list the school names, community names and average attendance for communities with a hardship index of 98.

In [66]:
cursor = conn.cursor()

sql='''SELECT CS.NAME_OF_SCHOOL, CD.COMMUNITY_AREA_NAME, CD.HARDSHIP_INDEX
FROM            dbo.Census_Data  CD INNER JOIN
                         dbo.Chicago_Public_Schools CS ON CD.COMMUNITY_AREA_NAME = CS.COMMUNITY_AREA_NAME AND 
                         CD.COMMUNITY_AREA_NUMBER = CS.COMMUNITY_AREA_NUMBER
WHERE        (CD.HARDSHIP_INDEX = 98)'''

cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["NAME_OF_SCHOOL", "COMMUNITY_AREA_NAME", "HARDSHIP_INDEX"])
data

,NAME_OF_SCHOOL,COMMUNITY_AREA_NAME,HARDSHIP_INDEX
0,William E B Dubois Elementary School,Riverdale,98
1,George Washington Carver Military Academy High...,Riverdale,98
2,George Washington Carver Primary School,Riverdale,98
3,Ira F Aldridge Elementary School,Riverdale,98

# Exercise 1, Question 2: 

Write and execute a SQL query to list all crimes that took place at a school. Include case number, crime type and community name.

In [69]:
cursor = conn.cursor()

sql='''SELECT CD.CASE_NUMBER, CD.PRIMARY_TYPE, CS.COMMUNITY_AREA_NAME
        FROM Chicago_Crime_Data CD INNER JOIN Chicago_Public_Schools CS ON 
             CD.COMMUNITY_AREA_NUMBER = CS.COMMUNITY_AREA_NUMBER
       GROUP BY CD.CASE_NUMBER, CD.PRIMARY_TYPE, CS.COMMUNITY_AREA_NAME'''

cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["CASE_NUMBER", "PRIMARY_TYPE", "COMMUNITY_AREA_NAME"])
data

    CASE_NUMBER         PRIMARY_TYPE     COMMUNITY_AREA_NAME
0       G577663            NARCOTICS            CHICAGO LAWN
1      HH329720    CRIMINAL TRESPASS                 DOUGLAS
2      HH337319  MOTOR VEHICLE THEFT          BELMONT CRAGIN
3      HH343366              ASSAULT               LAKE VIEW
4      HH352862  MOTOR VEHICLE THEFT  GREATER GRAND CROSSING
..          ...                  ...                     ...
485    JA559176                THEFT          NORTH LAWNDALE
486    JA560123      CRIMINAL DAMAGE               MONTCLARE
487    JB151690                THEFT           MCKINLEY PARK
488    JB155558            OBSCENITY                 ASHBURN
489    JB213238              BATTERY          BELMONT CRAGIN

[490 rows x 3 columns]

# Exercise 2, Question 1 : 

Write and execute a SQL statement that returns just the school name and leaders’ icon from the view.

In [71]:
cursor = conn.cursor()
sql='''CREATE VIEW SCHOOL_NAME_LEADER_ICON
AS
SELECT        NAME_OF_SCHOOL, LeadersIcon
FROM            Chicago_Public_Schools
GROUP BY NAME_OF_SCHOOL, LeadersIcon'''
cursor.execute(sql)
cursor.commit()
print("VIEW created successfully");
cursor.close()

VIEW created successfully

In [77]:
cursor = conn.cursor()
sql='''SELECT NAME_OF_SCHOOL, LeadersIcon
FROM Chicago_Public_Schools
GROUP BY NAME_OF_SCHOOL, LeadersIcon'''
cursor.execute(sql)
data = pd.DataFrame(cursor,columns=["NAME_OF_SCHOOL", "LeadersIcon"])
data

                                        NAME_OF_SCHOOL LeadersIcon
0                                 A.N. Pritzker School         NDA
1                    Abraham Lincoln Elementary School      Strong
2    Adam Clayton Powell Paideia Community Academy ...      Strong
3                  Adlai E Stevenson Elementary School         NDA
4                      Agustin Lara Elementary Academy      Strong
..                                                 ...         ...
561         Williams Preparatory Academy Middle School         NDA
562           Wilma Rudolph Elementary Learning Center         NDA
563                Wolfgang A Mozart Elementary School         NDA
564               Woodlawn Community Elementary School         NDA
565                 World Language Academy High School     Average

[566 rows x 2 columns]

# Exercise 3, Question 1: 

Write the structure of a query to create or replace a stored procedure called UPDATE_LEADERS_SCORE that takes a in_School_ID parameter as an integer and a in_Leader_Score parameter as an integer. Don't forget to use the #SET TERMINATOR statement to use the @ for the CREATE statement terminator.

In [83]:
%%sql
--#SET TERMINATOR @
CREATE PROCEDURE UPDATE_LEADERS_SCORE (@in_School_ID INTEGER, @in_Leader_Score INTEGER ) 

  BEGIN
    UPDATE "CHICAGO_PUBLIC_SCHOOLS"
    SET "Leaders_Score" = @in_Leader_Score
    WHERE "School_ID" = @in_School_ID;
   
  END;

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [84]:
Command(s) completed successfully.

SyntaxError: invalid syntax (Temp/ipykernel_15432/593978675.py, line 1)

# Exercise 3, Question 2: 

Inside your stored procedure, write a SQL statement to update the Leaders_Score field in the CHICAGO_PUBLIC_SCHOOLS table for the school identified by in_School_ID to the value in the in_Leader_Score parameter.

In [92]:
%%sql
--#SET TERMINATOR @
CREATE PROCEDURE UPDATE_LEADERS_SCORE (@in_School_ID INTEGER, @in_Leader_Score INTEGER ) 

  BEGIN
    UPDATE "CHICAGO_PUBLIC_SCHOOLS"
    SET "Leaders_Score" = @in_Leader_Score
    WHERE "School_ID" = @in_School_ID;
   
  END;

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [ ]:
Command(s) completed successfully.

# Exercise 3, Question 3: 

Inside your stored procedure, write a SQL IF statement to update the Leaders_Icon field in the CHICAGO_PUBLIC_SCHOOLS table for the school identified by in_School_ID using the following information.

In [86]:
--#SET TERMINATOR @
%%sql

CREATE PROCEDURE UPDATE_LEADERS_SCORE (
    @ in_School_ID  INTEGER, @in_Leader_Score INTEGER) 

  BEGIN
    UPDATE "CHICAGO_PUBLIC_SCHOOLS"
    SET "Leaders_Score" = @in_Leader_Score
    WHERE "School_ID" = @in_School_ID;
    IF @in_Leader_Score >=  80 THEN 
        UPDATE "CHICAGO_PUBLIC_SCHOOLS"
        SET "Leaders_Icon" = 'Very_Strong'
        WHERE "School_ID" = @in_School_ID;
    ELSEIF @in_Leader_Score>= 60 and @in_Leader_Score <= 79  THEN
        UPDATE "CHICAGO_PUBLIC_SCHOOLS"
        SET "Leaders_Icon" = 'Strong'
        WHERE "School_ID" = @in_School_ID;
    ELSEIF @in_Leader_Score >=  40 and @in_Leader_Score <= 59  THEN
        UPDATE "CHICAGO_PUBLIC_SCHOOLS"
        SET "Leaders_Icon" = 'Average'
        WHERE "School_ID" = @in_School_ID;
    ELSEIF @in_Leader_Score >=  20 and @in_Leader_Score <= 39  THEN
        UPDATE "CHICAGO_PUBLIC_SCHOOLS"
        SET "Leaders_Icon" = 'Weak'
        WHERE "School_ID" = @in_School_ID;
    ELSE
        UPDATE "CHICAGO_PUBLIC_SCHOOLS"
        SET "Leaders_Icon" = 'Very Weak'
        WHERE "School_ID" = @in_School_ID;
        END IF;
  END ;

SyntaxError: invalid syntax (Temp/ipykernel_15432/2039997931.py, line 1)

In [85]:
Command(s) completed successfully.

SyntaxError: invalid syntax (Temp/ipykernel_15432/593978675.py, line 1)

# Exercise 4, Question 1: 
    Update your stored procedure definition. Add a generic ELSE clause to the IF statement that rolls back the current work if the score did not fit any of the preceding categories.

In [90]:
%%sql
UPDATE "CHICAGO_PUBLIC_SCHOOLS"
SET 
   "Leaders_Score" = @in_Leader_Score
,  "Leaders_Icon" = 
   CASE 
     WHEN @in_Leader_Score >= 80                            
       THEN 'Very_Strong'
     WHEN @in_Leader_Score >= 60 and @in_Leader_Score <= 79  
       THEN 'Strong'
     WHEN @in_Leader_Score >= 40 and @in_Leader_Score <= 59  
       THEN 'Average'
     WHEN @in_Leader_Score >= 20 and @in_Leader_Score <= 39  
       THEN 'Weak'
     ELSE 'Very Weak'
   END
WHERE "School_ID" = @in_School_ID;

END TRY
    BEGIN CATCH
        IF @@TRANCOUNT == 0
        BEGIN
            ROLLBACK TRANSACTION "CHICAGO_PUBLIC_SCHOOLS"; -- rollback to CHICAGO_PUBLIC_SCHOOLS
        END
    END CATCH

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [91]:
Command(s) completed successfully.

SyntaxError: invalid syntax (Temp/ipykernel_15432/593978675.py, line 1)

# Exercise 4, Question 2: 

Update your stored procedure definition again. Add a statement to commit the current unit of work at the end of the procedure.

In [89]:
%%sql
UPDATE "CHICAGO_PUBLIC_SCHOOLS"
SET 
   "Leaders_Score" = @in_Leader_Score
,  "Leaders_Icon" = 
   CASE 
     WHEN in_Leader_Score >= 80                            
       THEN 'Very_Strong'
     WHEN in_Leader_Score >= 60 and in_Leader_Score <= 79  
       THEN 'Strong'
     WHEN in_Leader_Score >= 40 and in_Leader_Score <= 59  
       THEN 'Average'
     WHEN in_Leader_Score >= 20 and in_Leader_Score <= 39  
       THEN 'Weak'
     ELSE 'Very Weak'
   END
WHERE "School_ID" = in_School_ID;

COMMIT TRANSACTION "CHICAGO_PUBLIC_SCHOOLS"

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [88]:
Command(s) completed successfully.

SyntaxError: invalid syntax (Temp/ipykernel_15432/593978675.py, line 1)

Copyright © 2020 [cognitiveclass.ai](cognitiveclass.ai?utm_source=bducopyrightlink&utm_medium=dswb&utm_campaign=bdu). This notebook and its source code are released under the terms of the [MIT License](https://bigdatauniversity.com/mit-license?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ).

## Author(s)

<h4> Hima Vasudevan </h4>
<h4> Rav Ahuja </h4>
<h4> Ramesh Sannreddy </h4>

## Contribtuor(s)

<h4> Malika Singla </h4>

<a href ="https://github.com/vvchauit/5.Databases_and_SQL_for_Data_Science">Hands-on Lab : Github <h4>  <a/>
<a href ="https://www.linkedin.com/in/vanchauerpax/"> Chau Van </h4> </a>

## Change log

| Date       | Version | Changed by        | Change Description                             |
| ---------- | ------- | ----------------- | ---------------------------------------------- |
| 2021-09-04 | 2.5     | Chau Van          | Updated the question with SQL Server           |
| 2021-04-30 | 2.3     | Malika Singla     | Updated the libraries                          |
| 2021-01-15 | 2.2     | Rav Ahuja         | Removed problem 11 and fixed changelog         |
| 2020-11-25 | 2.1     | Ramesh Sannareddy | Updated the problem statements, and datasets   |
| 2020-09-05 | 2.0     | Malika Singla     | Moved lab to course repo in GitLab             |
| 2018-07-18 | 1.0     | Rav Ahuja         | Several updates including loading instructions |
| 2018-05-04 | 0.1     | Hima Vasudevan    | Created initial version                        |

## <h3 align="center"> © IBM Corporation 2020. All rights reserved. <h3/>